In [10]:
import pandas as pd
emp= {"name":["Ankit","Rahul","Priya"],"gender":["Male","Male","Female"], "email":["ankit@gmail.com","rahul@gmail.com","priya@gmail.com"] }
df1 = pd.DataFrame(emp)
df1

    name  gender            email
0  Ankit    Male  ankit@gmail.com
1  Rahul    Male  rahul@gmail.com
2  Priya  Female  priya@gmail.com

In [11]:
import pandas as pd
emp= {"name":["Pankaj","Sumit"],"gender":["Male","Male"], "email":["Pankaj@gmail.com","Sumit@gmail.com"] }
df2 = pd.DataFrame(emp)
df2

     name gender             email
0  Pankaj   Male  Pankaj@gmail.com
1   Sumit   Male   Sumit@gmail.com

In [27]:
#union / appending 2 dataframes
pd.concat([df1,df2] , ignore_index= True)
df=pd.concat([df1,df2] , ignore_index= True , axis=0)

In [31]:
#drop duplicates
emp= {"name":["Ankit","Rahul","Priya","Vicky"],"gender":["Male","Male","Female","Male"], "email":["ankit@gmail.com","rahul@gmail.com","priya@gmail.com","ankit@gmail.com"] }
df = pd.DataFrame(emp)
df

    name  gender            email
0  Ankit    Male  ankit@gmail.com
1  Rahul    Male  rahul@gmail.com
2  Priya  Female  priya@gmail.com
3  Vicky    Male  ankit@gmail.com

In [32]:
df.drop_duplicates()

    name  gender            email
0  Ankit    Male  ankit@gmail.com
1  Rahul    Male  rahul@gmail.com
2  Priya  Female  priya@gmail.com
3  Vicky    Male  ankit@gmail.com

In [42]:
df.drop_duplicates(subset = 'email')
df.drop_duplicates(subset = 'email' , keep = 'first')
df.drop_duplicates(subset = 'email' , keep = 'last')
#df.drop_duplicates(subset = ['email','gender'] , keep = 'first', inplace=True)
df.drop_duplicates(subset = 'email' , keep = False)

    name  gender            email
1  Rahul    Male  rahul@gmail.com
2  Priya  Female  priya@gmail.com

In [54]:
dfg= df.groupby('email')['name'].count()
dfg[dfg.values>1]

email
ankit@gmail.com    2
Name: name, dtype: int64

In [73]:
import pandas as pd
import numpy as np
emp= {"name":["Ankit","Rahul","Priya",34],"gender":[np.nan,"Male","Female",np.nan], "email":["ankit@gmail.com","rahul@gmail.com",np.nan,np.nan] }
df = pd.DataFrame(emp)
df

    name  gender            email
0  Ankit     NaN  ankit@gmail.com
1  Rahul    Male  rahul@gmail.com
2  Priya  Female              NaN
3     34     NaN              NaN

In [82]:
dff = pd.read_clipboard(sep=",")
dff

          order_id  return_reason
0   CA-2018-100006    bad quality
1              NaN  wrong product
2   CA-2018-100293    bad quality
3   CA-2018-100328    bad quality
4   CA-2018-100363  wrong product
5   CA-2018-100391  wrong product
6   CA-2018-100678         others
7   CA-2018-100706         others
8   CA-2018-100762    bad quality
9   CA-2018-100860  wrong product
10   CA-9999-99999  random return

In [62]:
df[df['gender'].isna()]

    name gender            email
0  Ankit    NaN  ankit@gmail.com

In [74]:
df.dropna()
df.dropna(how='any')
df.dropna(how='all' , axis='columns')
df.dropna(how='any',axis='columns')
df.dropna(subset=['name','email'] ,how='any',axis='index')

    name
0  Ankit
1  Rahul
2  Priya
3     34

In [77]:
df['gender'].fillna(value='new_male', inplace=True)
df

    name    gender            email
0  Ankit  new_male  ankit@gmail.com
1  Rahul      Male  rahul@gmail.com
2  Priya    Female              NaN
3     34  new_male              NaN